<center>
<h1>Факультет "Прикладная математика" МАИ</h1>
<h2>Курс "Основы Python для анализа данных"</h2>
<h2>Артамонов Игорь Михайлович</h2>
</center>

<center><h2>Занятие № 6. Введение в pandas.</h2></center>

## Общение / вопросы по курсу

Платформа для групповой работы Atlassian Confluence факультета "Прикладная математика"

https://mai.moscow/display/PYTML

* <b>Занятие 6. Введение в pandas.</b>
       * Серии (Series)
       * Датафрейм (DataFrame)

## virtualenv + Jupyter notebook

```
<Ctrl> + <Alt> + T - новое окно терминала
```

```
$ conda -V

$ conda update conda

$ conda search "^python$"

$ conda create -n yourenvname python=x.x anaconda

$ source activate yourenvname

$ jupyter notebook

$ conda install -n yourenvname [package]
```

# Общее

* pandas является одной из основных библиотек при работе с данными
* Основными типами данных pandas являются серия и датафрейм
* В основе этих элементов лежат массивы numpy, доступ к которым может быть легко полчен
* Сводить pandas к numpy __неверно__! pandas - __специализированная надстройка для работы с данными__, использующая массив только как эффективное средство для хранения данных и простых операций над ними
* С (очень) серьезными оговорками, pandas можно рассматривать как "сверхэффективный SQL таблицами в памяти"
* Важные функции pandas:
    - ввод / вывод
    - индексация
    - сортировка
    - работа с неполными и "грязными" данным
    - трансформация данных
    - объединение / разделение / комбинирование данных
    - агрегирование и групповые операции
    - кроме опреций ввода/вывода, pandas работает только с данными в памяти; это достаточно серьезное ограничение, следующее из его достоинств <br><br>
Импорт __pandas__ производится командой:

```python
    import pandas as pd
```

In [20]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import scipy as sc
%matplotlib inline

In [21]:
import os
import os.path

### Серия (Series)

* Серия - это данные, состоящие из одного столбца
* (на будущее) Один столбец датафрейма - это __серия__
* Работа с сериями и датафреймами __очень__ близка (можно что-то отладить на серии, как столбце, а потом применить к датафрейму)

In [137]:
sr = pd.Series([2, 7, 13, -6, -2, 17])
sr

0     2
1     7
2    13
3    -6
4    -2
5    17
dtype: int64

In [138]:
sr.index # индекс у серии - отдельный объект

RangeIndex(start=0, stop=6, step=1)

In [139]:
type(sr.index)

pandas.core.indexes.range.RangeIndex

In [140]:
sr.values

array([ 2,  7, 13, -6, -2, 17], dtype=int64)

In [141]:
type(sr.values)

numpy.ndarray

In [142]:
sr.values.shape

(6,)

In [146]:
sr.loc[2]  # обращается к ЗНАЧЕНИЮ 2 как к индексу (возвращает объект по индексу)

13

In [151]:
sr.iloc[2]  # ПРосто обращение по номеру (не по индексу)

13

In [153]:
srn = pd.Series([ 2,  7, 13, -6, -2, 17], index=['d', 'b', 'a', 'b', 'k', 'r'])
srn

d     2
b     7
a    13
b    -6
k    -2
r    17
dtype: int64

In [154]:
srn.index

Index(['d', 'b', 'a', 'b', 'k', 'r'], dtype='object')

In [160]:
type(srn.index)  # другой объект для индексов (родительский)

pandas.core.indexes.base.Index

In [163]:
srn.loc[['b','a']]  # выводим элементы по индексу

b     7
b    -6
a    13
dtype: int64

In [165]:
srn.loc[['b']]  # дублирующиеся индексы НЕ запрещены

b    7
b   -6
dtype: int64

In [166]:
# другая форма loc
srn[['b','a']]

b     7
b    -6
a    13
dtype: int64

In [168]:
srn[['b','c']]  # По несуществующему индексу - NaN

b    7.0
b   -6.0
c    NaN
dtype: float64

In [170]:
srn.reindex(['b','c'])  # нельзя реиндесировать 'b' т.к. по нему два значения

ValueError: cannot reindex from a duplicate axis

In [174]:
'r' in srn  # есть ли объект в серии

True

In [175]:
'z' in srn

False

In [176]:
sr[sr > 0]

0     2
1     7
2    13
5    17
dtype: int64

In [177]:
sr[sr < 0] * 2

3   -12
4    -4
dtype: int64

In [180]:
np.exp(srn)

d    7.389056e+00
b    1.096633e+03
a    4.424134e+05
b    2.478752e-03
k    1.353353e-01
r    2.415495e+07
dtype: float64

In [181]:
cit_dict = {
    'Москва':12506468,
    'Санкт-Петербург':5351935,
    'Новосибирск':1612833, 
    'Екатеринбург':1468833,
    'Нижний Новгород':1259013,
    'Казань':1243500,
    'Челябинск':1202371,
    'Омск':1172070,
    'Самара':1163399,
    'Ростов-на-Дону':1130305
}

In [183]:
cit = pd.Series(cit_dict)  # Серия из словаря
cit

Москва             12506468
Санкт-Петербург     5351935
Новосибирск         1612833
Екатеринбург        1468833
Нижний Новгород     1259013
Казань              1243500
Челябинск           1202371
Омск                1172070
Самара              1163399
Ростов-на-Дону      1130305
dtype: int64

In [185]:
cities = list(cit_dict.keys()) + ['Уфа', 'Красноярск']

In [186]:
cities

['Москва',
 'Санкт-Петербург',
 'Новосибирск',
 'Екатеринбург',
 'Нижний Новгород',
 'Казань',
 'Челябинск',
 'Омск',
 'Самара',
 'Ростов-на-Дону',
 'Уфа',
 'Красноярск']

In [196]:
cities.pop(0)

'Москва'

In [197]:
cit.index

Index(['Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург',
       'Нижний Новгород', 'Казань', 'Челябинск', 'Омск', 'Самара',
       'Ростов-на-Дону'],
      dtype='object')

In [199]:
cit2 = pd.Series(cit_dict, index=cities)
cit2

Санкт-Петербург    5351935.0
Новосибирск        1612833.0
Екатеринбург       1468833.0
Нижний Новгород    1259013.0
Казань             1243500.0
Челябинск          1202371.0
Омск               1172070.0
Самара             1163399.0
Ростов-на-Дону     1130305.0
Уфа                      NaN
Красноярск               NaN
dtype: float64

In [201]:
pd.isnull(cit2)  # индексация логическим массивом

Санкт-Петербург    False
Новосибирск        False
Екатеринбург       False
Нижний Новгород    False
Казань             False
Челябинск          False
Омск               False
Самара             False
Ростов-на-Дону     False
Уфа                 True
Красноярск          True
dtype: bool

In [203]:
pd.notnull(cit2)

Санкт-Петербург     True
Новосибирск         True
Екатеринбург        True
Нижний Новгород     True
Казань              True
Челябинск           True
Омск                True
Самара              True
Ростов-на-Дону      True
Уфа                False
Красноярск         False
dtype: bool

In [258]:
pd.notnull(cit2).value_counts()  # Подсчет количества одинаковых значений

True     9
False    2
dtype: int64

In [261]:
cit + cit2  # У двух серий разные индексы, могут быть с разными размерностями. 
# Складываем значения по совпадающим индексам

Екатеринбург        2937666.0
Казань              2487000.0
Красноярск                NaN
Москва                    NaN
Нижний Новгород     2518026.0
Новосибирск         3225666.0
Омск                2344140.0
Ростов-на-Дону      2260610.0
Самара              2326798.0
Санкт-Петербург    10703870.0
Уфа                       NaN
Челябинск           2404742.0
dtype: float64

In [265]:
cit2.name = 'Население' # Название серии
cit2.index.name = 'Город'  # Навание индекса серии
cit2

Город
Санкт-Петербург    5351935.0
Новосибирск        1612833.0
Екатеринбург       1468833.0
Нижний Новгород    1259013.0
Казань             1243500.0
Челябинск          1202371.0
Омск               1172070.0
Самара             1163399.0
Ростов-на-Дону     1130305.0
Уфа                      NaN
Красноярск               NaN
Name: Население, dtype: float64

### Датафрейм (DataFrame)

In [276]:
data = {'city': ['Москва','Санкт-Петербург','Новосибирск', 'Екатеринбург','Нижний Новгород', \
        'Казань', 'Челябинск', 'Омск', 'Самара', 'Ростов-на-Дону'],
        'year': [2010, 2012,2014,2016,2014,2016,2010,2013,2011,2016],
        'population': [12506468, 5351935, 1612833, 1468833, 1259013, 1243500, 1202371, 1172070, 1163399, 1130305]
       }

In [388]:
df = pd.DataFrame(data)

In [390]:
df

              city  year  population
0           Москва  2010    12506468
1  Санкт-Петербург  2012     5351935
2      Новосибирск  2014     1612833
3     Екатеринбург  2016     1468833
4  Нижний Новгород  2014     1259013
5           Казань  2016     1243500
6        Челябинск  2010     1202371
7             Омск  2013     1172070
8           Самара  2011     1163399
9   Ростов-на-Дону  2016     1130305

In [393]:
df.head(3)  # 3 верхние строки

              city  year  population
0           Москва  2010    12506468
1  Санкт-Петербург  2012     5351935
2      Новосибирск  2014     1612833

In [395]:
df.tail(5)  # 5 последних строки

             city  year  population
5          Казань  2016     1243500
6       Челябинск  2010     1202371
7            Омск  2013     1172070
8          Самара  2011     1163399
9  Ростов-на-Дону  2016     1130305

In [397]:
df_year = pd.DataFrame(df, columns=['year'])  # Создали датафрейм по одному столбцу
df_year

   year
0  2010
1  2012
2  2014
3  2016
4  2014
5  2016
6  2010
7  2013
8  2011
9  2016

In [399]:
type(df_year)  # создали DataFrame а не Seria

pandas.core.frame.DataFrame

In [400]:
type(df['year'])

pandas.core.series.Series

In [403]:
df.city  # Список по полю. Работает только с англ именами

0             Москва
1    Санкт-Петербург
2        Новосибирск
3       Екатеринбург
4    Нижний Новгород
5             Казань
6          Челябинск
7               Омск
8             Самара
9     Ростов-на-Дону
Name: city, dtype: object

In [404]:
df['city'] # Список по полю.

0             Москва
1    Санкт-Петербург
2        Новосибирск
3       Екатеринбург
4    Нижний Новгород
5             Казань
6          Челябинск
7               Омск
8             Самара
9     Ростов-на-Дону
Name: city, dtype: object

In [409]:
df[df['city'] == 'Москва']  # df['city'] == 'Москва' - возвращает серию для фильтрации (логический массив)

     city  year  population
0  Москва  2010    12506468

In [414]:
df2 = pd.DataFrame(data, columns=['year', 'city', 'population', 'income'],
                      index=['1', '2', '3', '4', '5', '6', '7', '8', '9', '10'])  # Дополнительная колнка income

In [417]:
df2

    year             city  population income
1   2010           Москва    12506468    NaN
2   2012  Санкт-Петербург     5351935    NaN
3   2014      Новосибирск     1612833    NaN
4   2016     Екатеринбург     1468833    NaN
5   2014  Нижний Новгород     1259013    NaN
6   2016           Казань     1243500    NaN
7   2010        Челябинск     1202371    NaN
8   2013             Омск     1172070    NaN
9   2011           Самара     1163399    NaN
10  2016   Ростов-на-Дону     1130305    NaN

In [423]:
df2.loc['1']  # Получаем резльтат по индексу 1. ИНДЕКС str

year              2010
city            Москва
population    12506468
income             123
Name: 1, dtype: object

In [426]:
df2.iloc[1:3]  # Получаем резльтат по номер 1. НОМЕР int

   year             city  population  income
2  2012  Санкт-Петербург     5351935     123
3  2014      Новосибирск     1612833     123

In [428]:
df2.income = 123.456  # Засунули везде значение 
df2.income = df2.income.astype(int)

In [429]:
df2

    year             city  population  income
1   2010           Москва    12506468     123
2   2012  Санкт-Петербург     5351935     123
3   2014      Новосибирск     1612833     123
4   2016     Екатеринбург     1468833     123
5   2014  Нижний Новгород     1259013     123
6   2016           Казань     1243500     123
7   2010        Челябинск     1202371     123
8   2013             Омск     1172070     123
9   2011           Самара     1163399     123
10  2016   Ростов-на-Дону     1130305     123

In [431]:
df2.dtypes  # типы всех данных по столбцам

year           int64
city          object
population     int64
income         int32
dtype: object

In [508]:
df.columns

Index(['city', 'year', 'population'], dtype='object')

In [515]:
df2.income = np.arange(100,200, 10)  # кладем разные значения в income. Должно совпадать с колич индексов

In [516]:
df2

    year             city  population  income
1   2010           Москва    12506468     100
2   2012  Санкт-Петербург     5351935     110
3   2014      Новосибирск     1612833     120
4   2016     Екатеринбург     1468833     130
5   2014  Нижний Новгород     1259013     140
6   2016           Казань     1243500     150
7   2010        Челябинск     1202371     160
8   2013             Омск     1172070     170
9   2011           Самара     1163399     180
10  2016   Ростов-на-Дону     1130305     190

In [517]:
df2.dtypes

year           int64
city          object
population     int64
income         int32
dtype: object

In [518]:
df2 = pd.DataFrame(data, columns=['year', 'city', 'population', 'income'],
                      index=['1', '2', '3', '4', '5', '6', '7', '8', '9', '10'])

In [520]:
income = pd.Series([123,456,789,1010], index = ['1','2', '8', '11'])  # ОТДЕЛЬНО создае серию

In [527]:
df2['income'] = income  # Кладет значение по совпадающим индексам, иначе NaN
# Если есть идекс которого нет в df2 -> не добавляет никакого элемента, т.к. Добавляем В df2 (т.е. ключевые индексы именно из него)

In [528]:
df2

    year             city  population  income
1   2010           Москва    12506468   123.0
2   2012  Санкт-Петербург     5351935   456.0
3   2014      Новосибирск     1612833     NaN
4   2016     Екатеринбург     1468833     NaN
5   2014  Нижний Новгород     1259013     NaN
6   2016           Казань     1243500     NaN
7   2010        Челябинск     1202371     NaN
8   2013             Омск     1172070   789.0
9   2011           Самара     1163399     NaN
10  2016   Ростов-на-Дону     1130305     NaN

In [539]:
df2['big'] = df2['population'] > 1500000  # Создаем еще один стобец по условию

In [540]:
df2

    year             city  population  income    big
1   2010           Москва    12506468   123.0   True
2   2012  Санкт-Петербург     5351935   456.0   True
3   2014      Новосибирск     1612833     NaN   True
4   2016     Екатеринбург     1468833     NaN  False
5   2014  Нижний Новгород     1259013     NaN  False
6   2016           Казань     1243500     NaN  False
7   2010        Челябинск     1202371     NaN  False
8   2013             Омск     1172070   789.0  False
9   2011           Самара     1163399     NaN  False
10  2016   Ростов-на-Дону     1130305     NaN  False

In [541]:
del df2['big']   # Удаляем колнку
df2.columns

Index(['year', 'city', 'population', 'income'], dtype='object')

In [638]:
df.drop(columns=['big'], axis=1)  # аналогично удаляет колонку.
# Может удалять строку если axis=0 по индексу df.drop(columns=['2'], axis=0)

KeyError: "['big'] not found in axis"

In [545]:
df.T

,0,1,2,3,4,5,6,7,8,9
city,Москва,Санкт-Петербург,Новосибирск,Екатеринбург,Нижний Новгород,Казань,Челябинск,Омск,Самара,Ростов-на-Дону
year,2010,2012,2014,2016,2014,2016,2010,2013,2011,2016
population,12506468,5351935,1612833,1468833,1259013,1243500,1202371,1172070,1163399,1130305

In [548]:
population = {'Москва': {2010: 11.4, 2011:11.9, 2013:12.1},
       'Новосибирск': {2010:1.5, 2012:1.7, 2013:3.6}}

In [549]:
df3 = pd.DataFrame(population)
df3

      Москва  Новосибирск
2010    11.4          1.5
2011    11.9          NaN
2013    12.1          3.6
2012     NaN          1.7

In [551]:
pd.DataFrame(population, index=[2010, 2011, 2012, 2013])  # тот же индекс но меняются порядком стркои как сейчас указали

      Москва  Новосибирск
2010    11.4          1.5
2011    11.9          NaN
2012     NaN          1.7
2013    12.1          3.6

In [552]:
df.values

array([['Москва', 2010, 12506468],
       ['Санкт-Петербург', 2012, 5351935],
       ['Новосибирск', 2014, 1612833],
       ['Екатеринбург', 2016, 1468833],
       ['Нижний Новгород', 2014, 1259013],
       ['Казань', 2016, 1243500],
       ['Челябинск', 2010, 1202371],
       ['Омск', 2013, 1172070],
       ['Самара', 2011, 1163399],
       ['Ростов-на-Дону', 2016, 1130305]], dtype=object)

In [554]:
type(df.values)

numpy.ndarray

In [556]:
df.iloc[3,0:1] = 0  # iloc мжет работать с сечениями
df

              city  year  population
0           Москва  2010    12506468
1  Санкт-Петербург  2012     5351935
2      Новосибирск  2014     1612833
3                0  2016     1468833
4  Нижний Новгород  2014     1259013
5           Казань  2016     1243500
6        Челябинск  2010     1202371
7             Омск  2013     1172070
8           Самара  2011     1163399
9   Ростов-на-Дону  2016     1130305

In [558]:
df = pd.DataFrame(population)
df

      Москва  Новосибирск
2010    11.4          1.5
2011    11.9          NaN
2013    12.1          3.6
2012     NaN          1.7

In [559]:
df.index.name = 'year'; 
df.columns.name = 'city'
df

city  Москва  Новосибирск
year
2010    11.4          1.5
2011    11.9          NaN
2013    12.1          3.6
2012     NaN          1.7

In [561]:
df.values  # Индекс не попадает в values

array([[11.4,  1.5],
       [11.9,  nan],
       [12.1,  3.6],
       [ nan,  1.7]])

### Индексы, как объекты

In [562]:
sr = pd.Series(range(5), index=['a', 'b', 'c', 'd', 'e'])
index = sr.index
index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [566]:
index[1:3]  #с индексом можно работать также как и с массивом

Index(['b', 'c'], dtype='object')

In [569]:
labels = pd.Index(np.arange(5))  # индекс из любого итерируемого, например массива
labels
df2 = pd.Series([1.5, -2.5, 0, 14, -2.2], index=labels)
df2

0     1.5
1    -2.5
2     0.0
3    14.0
4    -2.2
dtype: float64

In [573]:
df2.index is labels

True

#### <font color='green'>Вопрос.</font>
Для чего нужна предыдущая команда?
Ответ - Когда вырезаем из df столбец, работаем с ним по индексам,а потом хотим например слить обратно

In [574]:
df
df.columns

Index(['Москва', 'Новосибирск'], dtype='object', name='city')

In [575]:
'Москва' in df.columns

True

In [576]:
2003 in df.index

False

In [578]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])  # Можно содать индекс отдельно
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

### Ввод из файлов

In [621]:
%ls *.xls

 ’®¬ ў гбва®©бвўҐ C ­Ґ Ё¬ҐҐв ¬ҐвЄЁ.
 ‘ҐаЁ©­л© ­®¬Ґа в®¬ : 2269-C3D5

 ‘®¤Ґа¦Ё¬®Ґ Ї ЇЄЁ C:\Users\Ђ«ҐбЄ ­¤а\Downloads

11.10.2019  18:02            38я912 ru-cities.xls
               1 д ©«®ў         38я912 Ў ©в
               0 Ї Ї®Є  30я542я176я256 Ў ©в бў®Ў®¤­®

In [622]:
df = pd.read_excel('ru-cities.xls',skiprows=8)   # read_excel считает что верхняя строка - названия колонок

In [623]:
df.shape

(175, 6)

In [624]:
df.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5
0,1.0,Москва,NaN,11514.3,5332.7,6181.6
1,2.0,Санкт-Петербург,NaN,4848.7,2209.6,2639.1
2,3.0,Новосибирск,Новосибирская область,1473.7,676.5,797.2
3,4.0,Екатеринбург,Свердловская область,1350.1,605.4,744.7
4,5.0,Нижний Новгород,Нижегородская область,1250.6,550.2,700.4

In [625]:
df.iloc[100]

Unnamed: 0                    17
Unnamed: 1                 Химки
Unnamed: 2    Московская область
Unnamed: 3                 207.1
Unnamed: 4                  94.6
Unnamed: 5                 112.5
Name: 100, dtype: object

In [626]:
df.to_csv('ru-cities.csv')  # Сохранение в csv файл

In [627]:
%ls *.csv

 ’®¬ ў гбва®©бвўҐ C ­Ґ Ё¬ҐҐв ¬ҐвЄЁ.
 ‘ҐаЁ©­л© ­®¬Ґа в®¬ : 2269-C3D5

 ‘®¤Ґа¦Ё¬®Ґ Ї ЇЄЁ C:\Users\Ђ«ҐбЄ ­¤а\Downloads

11.10.2019  19:25            14я067 ru-cities.csv
               1 д ©«®ў         14я067 Ў ©в
               0 Ї Ї®Є  30я542я176я256 Ў ©в бў®Ў®¤­®

## <font color=red>ЗАДАНИЕ</font>

Определите:
* названия колонок и индекса
* переименуйте колонки и индексы любым удобным Вам способом
* найдите города с населением от 600 до 700 тысяч человек

In [633]:
print(df.columns[0])
print(df[:35])

ind
     ind                                              Номер  \
0    1.0                                             Москва
1    2.0                                    Санкт-Петербург
2    3.0                                        Новосибирск
3    4.0                                       Екатеринбург
4    5.0                                    Нижний Новгород
5    6.0                                             Самара
6    7.0                                               Омск
7    8.0                                             Казань
8    9.0                                          Челябинск
9   10.0                                     Ростов-на-Дону
10  11.0                                                Уфа
11  12.0                                          Волгоград
12   NaN                                                NaN
13   NaN  II. Города с численностью населения от 500 тыс...
14   NaN                                                NaN
15   1.0                                              Пермь
16   2.0                                         Красноярск
17   3.0                                            Воронеж
18   4.0                                            Саратов
19   5.0                                          Краснодар
20   6.0                                           Тольятти
21   7.0                                             Ижевск
22   8.0                                          Ульяновск
23   9.0                                            Барнаул
24  10.0                                        Владивосток
25  11.0                                          Ярославль
26  12.0                                            Иркутск
27  13.0                                             Тюмень
28  14.0                                          Махачкала
29  15.0                                          Хабаровск
30  16.0                                        Новокузнецк
31  17.0                                           Оренбург
32  18.0                                           Кемерово
33  19.0                                             Рязань
34  20.0                                              Томск

                      Город  Область       3       5
0                       NaN  11514.3  5332.7  6181.6
1                       NaN   4848.7  2209.6  2639.1
2     Новосибирская область   1473.7   676.5   797.2
3      Свердловская область   1350.1   605.4   744.7
4     Нижегородская область   1250.6   550.2   700.4
5         Самарская область   1164.9   522.4   642.5
6            Омская область   1154.0   525.8   628.2
7      Республика Татарстан   1143.6   510.9   632.7
8       Челябинская область   1130.3   506.6   623.7
9        Ростовская область   1089.9   498.8   591.1
10  Республика Башкортостан   1062.3   480.8   581.5
11    Волгоградская область   1021.2   462.3   558.9
12                      NaN      NaN     NaN     NaN
13                      NaN      NaN     NaN     NaN
14                      NaN      NaN     NaN     NaN
15            Пермский край    991.5   438.6   552.9
16        Красноярский край    973.9   441.2   532.7
17      Воронежская область    890.0   401.7   495.3
18      Саратовская область    837.8   374.3   463.5
19       Краснодарский край    744.9   337.9   407.0
20        Самарская область    719.5   331.8   387.7
21    Удмуртская Республика    628.1   281.0   347.1
22      Ульяновская область    613.8   278.0   335.8
23           Алтайский край    612.1   272.8   339.3
24          Приморский край    592.1   278.5   313.6
25      Ярославская область    591.5   259.8   331.7
26        Иркутская область    587.2   263.6   323.6
27        Тюменская область    581.8   268.1   313.7
28      Республика Дагестан    578.0   272.6   305.4
29         Хабаровский край    577.7   268.5   309.2
30      Кемеровская область    547.9   247.2   300.7
31     Оренбургская область    547.0   249.9   297.1
32      Кемеровская область    532.9   238.5   294.4
33        Рязанская область    525.1   237.4   287.7
34         Томская область     522.9   243.1   279.8

In [635]:
df.rename(columns={df.columns[0]: 'ind', df.columns[1]: 'Номер', df.columns[2]: "Город",  df.columns[3]: "Область",  df.columns[4]: "3", df.columns[5]: "4", df.columns[5]: "5"}, inplace=True)
print(df_org.columns)

Index(['Номер', 'Город', 'Область', '3', 'Unnamed: 4', 'Unnamed: 5'], dtype='object')

In [648]:
df_correct = df[df['ind'].notnull()]
df_correct[(df_correct['5']) > 600 & (df_correct['5'] < 700)]

      ind              Номер                  Город  Область       3       5
0     1.0             Москва                    NaN  11514.3  5332.7  6181.6
1     2.0    Санкт-Петербург                    NaN   4848.7  2209.6  2639.1
2     3.0        Новосибирск  Новосибирская область   1473.7   676.5   797.2
3     4.0       Екатеринбург   Свердловская область   1350.1   605.4   744.7
4     5.0    Нижний Новгород  Нижегородская область   1250.6   550.2   700.4
..    ...                ...                    ...      ...     ...     ...
170  87.0       Междуреченск    Кемеровская область    102.0    47.5    54.5
171  88.0  Ленинск-Кузнецкий    Кемеровская область    101.7    46.6    55.1
172  89.0            Сарапул  Удмуртская Республика    101.4    45.2    56.2
173  90.0         Ессентуки     Ставропольский край    101.0    45.1    55.9
174  91.0           Воткинск  Удмуртская Республика    100.0    45.4    54.6

[164 rows x 6 columns]

## Дополнительная функциональность

### Реиндексация

In [649]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [651]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])  # изменяем индексы в след последовательности (нужен для сортировки)
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [654]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [655]:
obj3.reindex(range(6), method='ffill')  # Делает новые индексы с 0 до 6
# Если для индекса нет значения то заполняет его предыдущим значением

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [657]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [658]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [660]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)  # реиндексация по конткретной колонке

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [661]:
frame.loc[['a', 'b', 'c', 'd'], states]

c:\program files\python37\lib\site-packages\pandas\core\indexing.py:1418: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

### Удаление записей из оси

In [662]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [664]:
new_obj = obj.drop(['c','d'])  # Удаление записей. Сам объект не меняется
new_obj

a    0.0
b    1.0
e    4.0
dtype: float64

In [668]:
obj.drop('c', inplace=True)  # Удаляет запись по индексу у самого объекта. Изменяет obj из-за inplace=True

KeyError: "['c'] not found in axis"

In [669]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [670]:
obj.drop(['d', 'c'])  # если удален уже, то кидает ошибку

KeyError: "['c'] not found in axis"

In [673]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [674]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [677]:
data.drop(['two', 'four'], axis='columns')  # аналогично если axis=1

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [678]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [679]:
data.drop('four', inplace=True)
data

KeyError: "['four'] not found in axis"

<b>ВОПРОС.</b> Что пошло не так?
ответ - нет такой оси

### Индексация, выбор и фильтрация

In [680]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [683]:
obj['c']  # аналогично obj.loc['c']

2.0

In [689]:
obj[2]  # срабатывает т.к. идет неявный iloc. Пытается найти эл-т с таким же нормером. Срабатывает только для ЦЕЛОЧИСЛЕННЫХ 
# послед индексов

2.0

In [691]:
type(obj.index)

pandas.core.indexes.base.Index

In [692]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [694]:
obj[['b', 'a', 'd']]  # индексация списков индексов

b    1.0
a    0.0
d    3.0
dtype: float64

In [695]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [696]:
obj[obj < 2] # выводит все значения серии где значение < 2

a    0.0
b    1.0
dtype: float64

In [697]:
obj[2:3]

c    2.0
dtype: float64

In [698]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [699]:
obj.iloc[2:3]

c    2.0
dtype: float64

In [700]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [702]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [703]:
data['two'], type(data['two'])

(Ohio         1
 Colorado     5
 Utah         9
 New York    13
 Name: two, dtype: int32, pandas.core.series.Series)

In [704]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [705]:
data[:2]
data[data.three > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [706]:
data < 5
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### Выбор с loc и unloc

In [709]:
print(data.loc['Colorado', ['two', 'three']])  # на любом  месте могут стоять списки/сечения
data.loc['Colorado', 'two': 'three']  # на любом  месте могут стоять списки/сечения

two      5
three    6
Name: Colorado, dtype: int32

two      5
three    6
Name: Colorado, dtype: int32

In [710]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [711]:
data.iloc[2]
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [713]:
data.loc[:'Utah', 'two']
data.iloc[:, :3][data.three > 5]
 # наоборот - data.iloc[data.three > 5][:, :3] - редко используется

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### Целочисленная индексация

In [721]:
ser = pd.Series(np.arange(3.)) 
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [722]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [723]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

2.0

In [724]:
ser[:1]
ser.loc[:1]
ser.iloc[:1]

0    0.0
dtype: float64

### Арифметические операции

In [725]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=['a', 'c', 'e', 'f', 'g'])

In [726]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [727]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [731]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [732]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [889]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [890]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [893]:
df1 + df2  # если не может выполнить операцию -> NaN.

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [894]:
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'B': [3, 4]})

In [896]:
df1

   A
0  1
1  2

In [897]:
df2

   B
0  3
1  4

In [899]:
df1 - df2  # ошибки т.к. в первое df нет столбца A а во втором нет A. То есть не может их вычитать

    A   B
0 NaN NaN
1 NaN NaN

### Арифметические действия и заполнение

In [900]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))

In [901]:
df2.loc[1, 'b'] = np.nan
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [902]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [903]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [910]:
df1.add(df2, fill_value=0)  # заполняет нулями отсутствующие значения в обоих df

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [912]:
1 / df1  # деление на 0 -> inf

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [914]:
df1.rdiv(1)  # нечто/на df. Аналог выше

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [915]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

### Операции над датафреймами и сериями

In [916]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [917]:
arr[0]

array([0., 1., 2., 3.])

In [918]:
arr - arr[0]  # вычитаем значение серии в соответсвии с индексом, применяемым с строке

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

<b>ВОПРОС.</b> В чём отличие поведения от numpy.array?

In [920]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.iloc[0]

In [921]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [922]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [923]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [924]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [925]:
series3 = frame['d']
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [927]:
series3  # строка в виде серии

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [95]:
frame.sub(series3, axis='columns') # вычитание. т.к. в df нет таких имен то NaN

        Ohio  Oregon  Texas  Utah   b   d   e
Utah     NaN     NaN    NaN   NaN NaN NaN NaN
Ohio     NaN     NaN    NaN   NaN NaN NaN NaN
Texas    NaN     NaN    NaN   NaN NaN NaN NaN
Oregon   NaN     NaN    NaN   NaN NaN NaN NaN

### Применение функций и отображение

In [928]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -0.451053 -0.265430 -0.562293
Ohio    1.891040  0.297844 -0.682832
Texas  -0.369143 -0.275058 -1.077939
Oregon  1.218085 -0.640382 -0.702624

In [930]:
np.abs(frame)

               b         d         e
Utah    0.451053  0.265430  0.562293
Ohio    1.891040  0.297844  0.682832
Texas   0.369143  0.275058  1.077939
Oregon  1.218085  0.640382  0.702624

In [933]:
f = lambda x: x.max() - x.min()
frame.apply(f,axis=0)  # Применяет функцию КО всем столбцам (по строкам вычисляем макс и мин зн-ние)
# При axis=1(столбцы) - то берем первую строку и идем по значениям СТОЛБЦОВ.

b    2.342093
d    0.938226
e    0.515646
dtype: float64

In [934]:
type(frame.apply(f,axis=0))

pandas.core.series.Series

In [935]:
frame.apply(f, axis='columns')

Utah      0.296862
Ohio      2.573872
Texas     0.802881
Oregon    1.920709
dtype: float64

In [940]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])  # Возвращаем два значения min и max по каждому столбцу

frame.apply(f, axis=1)

             min       max
Utah   -0.562293 -0.265430
Ohio   -0.682832  1.891040
Texas  -1.077939 -0.275058
Oregon -0.702624  1.218085

In [945]:
format_ = lambda x: '%.2f' % x
frame.applymap(format_)

            b      d      e
Utah    -0.45  -0.27  -0.56
Ohio     1.89   0.30  -0.68
Texas   -0.37  -0.28  -1.08
Oregon   1.22  -0.64  -0.70

In [946]:
frame['e'].map(format)

Utah      -0.56
Ohio      -0.68
Texas     -1.08
Oregon    -0.70
Name: e, dtype: object

## <font color=red>ЗАДАНИЕ</font>

Сделайте лямда-функцию, вычисляющую отклонения населения города РФ от среднего, 
и заполнящую этим значением новый столбец с именем 'Отклонение'

In [975]:
# TODO сделать столбец отклонений, а потому новый столбец = вычитание этих двух
def f(x):
    return pd.Series([x.mean() - x], index=['1'])  # Возвращаем два значения min и max по каждому столбцу

series = frame.apply(f, axis=1)
series
# frame['отклонение'] = frame['b'].apply((lambda x: x.mean() - x))

                                                        1
Utah    b    0.024794
d   -0.160828
e    0.136034
Name...
Ohio    b   -1.389022
d    0.204173
e    1.184849
Name...
Texas   b   -0.204903
d   -0.298989
e    0.503892
Name...
Oregon  b   -1.259725
d    0.598741
e    0.660984
Name...

### Сортировка и ранжирование

In [977]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()  # сортируем по индексам

a    1
b    2
c    3
d    0
dtype: int64

In [979]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [982]:
frame.sort_index(axis=1)  # сортировка по axis=1=столбцы

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [984]:
frame.sort_index(axis=1, ascending=False)   # по возрастанию = False

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [1001]:
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()  # Сортировка по значениям. Перетасовался индекс

2   -3
3    2
0    4
1    7
dtype: int64

In [1014]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()  # NaN ВСЕГДА в конце (при любой сортировке по уб/возр)

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [1015]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [1016]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [1019]:
frame.sort_values(by=['a', 'b']) # вложенная сортировка. Сначала сортируем по 'a' и потом внутри ее по 'b'

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [1022]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()  # ранк значения. Показывает на каком месте должен находится соответсвтующее значение из серии

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [1025]:
obj.rank(method='first')  # место обязательно должно быть целом. При дублировании порядок определяется какое всеретилось первым

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [1026]:
# Присвоение значений максимального ранга в группе
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [1033]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})
frame
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [1034]:
sr = pd.Series([10, 25, 3, 11, 24, 6, 25]) 
index_ = ['Coca Cola', 'Sprite', 'Coke', 'Fanta', 'Dew', 'ThumbsUp', 'Appy'] 
sr.index = index_ 
print(sr)

Coca Cola    10
Sprite       25
Coke          3
Fanta        11
Dew          24
ThumbsUp      6
Appy         25
dtype: int64

In [1035]:
result = sr.rank() 
print(result)

Coca Cola    3.0
Sprite       6.5
Coke         1.0
Fanta        4.0
Dew          5.0
ThumbsUp     2.0
Appy         6.5
dtype: float64

### Индексация осей и дублирующиеся метки

In [1038]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [1099]:
obj.index.is_unique  #  Проверка индекса на уникальность

False

In [1103]:
obj['a']  # Полчаем СЕРИЮ

a    0
a    1
dtype: int64

In [1105]:
obj['c'] # Получаем значение. см предыдущее. Из-за этого и важна уникальность ключа

4

In [1106]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a -0.729330 -0.412302  0.197868
a  2.153521 -1.429398 -0.477298
b  1.142511  0.823434  0.363458
b  0.318901  0.330357  0.787582

In [1108]:
df.loc['b']  # получаем df

          0         1         2
b  1.142511  0.823434  0.363458
b  0.318901  0.330357  0.787582

## Статистика и функции агрегирования

In [1109]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [1112]:
df.sum()  # Умеет суммировать NaN (просто их пропускает)

one    9.25
two   -5.80
dtype: float64

In [126]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [1114]:
df.mean(axis='columns', skipna=False) # skipna=False - не пропускает NaN -> при суммировании получается NaN

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [1116]:
df.idxmax()  # Максимум по индексам

one    b
two    d
dtype: object

In [1119]:
df.cumsum()  # Кумуллятивная сумма (отчет с накопленном итогом)

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [1120]:
df.shape

(4, 2)

In [1126]:
df.describe()  # стандартная инфа. Nan НЕ показывает (см выше df.shape)

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [1127]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Корреляция и ковариация

In [1129]:
!conda install pandas-datareader  # хорошо работает с биржевыми данными
# !pip install pandas-datareader

"conda" ­Ґ пў«пҐвбп ў­гваҐ­­Ґ© Ё«Ё ў­Ґи­Ґ©
Є®¬ ­¤®©, ЁбЇ®«­пҐ¬®© Їа®Ја ¬¬®© Ё«Ё Ї ЄҐв­л¬ д ©«®¬.

In [1130]:
price = pd.read_pickle('yahoo_price.pkl')   # .pkl - данные выгрузки с бирж
volume = pd.read_pickle('yahoo_volume.pkl')

FileNotFoundError: [Errno 2] No such file or directory: 'yahoo_price.pkl'

In [1131]:
import pandas_datareader.data as web

ModuleNotFoundError: No module named 'pandas_datareader'

In [1132]:
all_data = {ticker: web.get_data_yahoo(ticker) for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

NameError: name 'web' is not defined

In [1133]:
price = pd.DataFrame({ticker: data['Adj Close'] for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume'] for ticker, data in all_data.items()})

NameError: name 'all_data' is not defined

In [1134]:
returns = price.pct_change()
returns.tail()

NameError: name 'price' is not defined

In [1135]:
returns = price.pct_change()
returns.tail()

NameError: name 'price' is not defined

In [1136]:
returns['MSFT'].corr(returns['IBM'])
returns['MSFT'].cov(returns['IBM'])

NameError: name 'returns' is not defined

In [ ]:
returns.MSFT.corr(returns.IBM)

In [ ]:
returns.corr()
returns.cov()

In [ ]:
returns.corrwith(returns.IBM)

In [ ]:
returns.corrwith(volume)

### Уникальные значения, подсчет значений и членство

In [1138]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [1139]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [1140]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [1141]:
pd.value_counts(obj.values, sort=False)

c    3
a    3
d    1
b    2
dtype: int64

In [1143]:
obj
mask = obj.isin(['b', 'c'])
mask
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [1147]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
unique_vals = pd.Series(['c', 'b', 'a'])  # значем уникальные значения из серии выше
pd.Index(unique_vals).get_indexer(to_match)  # Возвращает в каком месте какое уникальное значние стоит

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [1154]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [1156]:
result = data.apply(pd.value_counts).fillna(0) # заполнение 0незначащих значений
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## Экзаменационные вопросы:

* Серии и датафреймы pandas
* Индексация серий и датафреймов pandas
* Математические операции с сериями и датафреймами pandas